"""
Задача 5. Валидатор Пользовательских Данных.

Создайте класс User, который содержит атрибуты name, email, и age.
Необходимо убедиться, что:
    ● Имя состоит из хотя бы двух слов, каждое из которых начинается с заглавной буквы.
    ● Электронная почта содержит символ @ и точку . после @.
    ● Возраст — это положительное целое число, не меньше 0 и не больше 120.

Создайте пользовательские исключения для каждой из этих проверок:
    ● NameError: Если имя не соответствует формату.
    ● EmailError: Если электронная почта не соответствует формату.
    ● AgeError: Если возраст вне допустимого диапазона.
"""
