"""
Задание 1. Тестирование класса с использованием pytest.

Напишите класс BankAccount, который управляет балансом счета. Он должен поддерживать следующие методы:
    ● deposit(amount): добавляет указанную сумму к балансу.
    ● withdraw(amount): снимает указанную сумму с баланса, если достаточно средств.
    ● get_balance(): возвращает текущий баланс счета.

При попытке снять больше средств, чем доступно на счете, должно
выбрасываться исключение InsufficientFundsError.
Напишите как минимум 5 тестов для проверки работы классов и его методов.
"""
