"""
Задание 1. Отцы, матери и дети.
Вася совсем заскучал на работе и решил побаловаться с кодом проекта.
Реализуйте два класса: «Родитель» и «Ребёнок».
У родителя есть:
    ● имя,
    ● возраст,
    ● список детей.
И он может:
    ● сообщить информацию о себе,
    ● успокоить ребёнка,
    ● покормить ребёнка.
У ребёнка есть:
    ● имя,
    ● возраст (должен быть меньше возраста родителя хотя бы на 16 лет),
    ● состояние спокойствия,
    ● состояние голода.
Реализация состояний — на ваше усмотрение.
Это может быть и простой «флаг», и словарь состояний, и что-то поинтереснее.
"""
